Revit 2024 API
RebarCoupler.IsUnobscuredInView Method
 Checks if this rebar coupler element is shown unobscured in a view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.3
Syntax
C#
public bool IsUnobscuredInView(
	View view
)
Visual Basic
Public Function IsUnobscuredInView ( _
	view As View _
) As Boolean
Visual C++
public:
bool IsUnobscuredInView(
	View^ view
)
Parameters
view
Type: Autodesk.Revit.DB.View
 The view element
Return Value
 True if rebar coupler is shown unobscured, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InapplicableDataException |  This rebar coupler element doesn't have valid visibility data
See Also
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace